import streamlit as st

# Просто заголовок и кнопка
st.title("🚀 Космический анализатор радиации")

# Кнопка
clicked = st.button("📚 Теория")

# Если кнопка нажата - показываем текст
if clicked:
    st.header("Статья о космической радиации")
    st.write("Здесь будет ваш текст о космической радиации")
    st.markdown("[Читать полную статью](https://www.vokrugsveta.ru/articles/nevidimaya-ugroza-na-puti-k-drugim-planetam-chto-takoe-kosmicheskaya-radiaciya-i-kak-ot-nee-zashititsya-id6255282/)")
else:
    st.write("Нажмите кнопку 'Теория' выше") 

    ##
